app/controllers/main_controller.rb

	def all
		@cases = Case.all
---
SELECT "cases".* FROM "cases"

	def find
		@selected_tag = Tag.find_by(id: params["tag_id"])
---
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT 1  [["id", 4]]